Tekla Open API Reference for Tekla Structures 2025
ViewHandler.SetRepresentation Method
Sets the object representation.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetRepresentation(
	string Representation
)
Public Shared Function SetRepresentation (
	Representation As String
) As Boolean
Parameters
Representation
Type: System.String
The representation that is to be used. 257 characters at most.
Return Value
Type: Boolean
True on success.
See Also
Reference
ViewHandler Class
Tekla.Structures.Model.UI Namespace